tap "homebrew/services"
tap "neovim/neovim"
tap "oven-sh/bun"

# Core tools
brew "git"
brew "neovim"
brew "tmux"
brew "ripgrep"
brew "jq"
brew "wget"
brew "tree"
brew "dos2unix"
brew "fswatch"
brew "blueutil"
brew "jj"

# Languages & runtimes
brew "node"
brew "oven-sh/bun/bun"

# Cloud & infra
brew "colima", restart_service: :changed
brew "docker-compose"
brew "docker-credential-helper"

# macOS apps
cask "1password"
cask "1password-cli"
cask "arc"
cask "ghostty"
cask "hammerspoon"
cask "karabiner-elements"
cask "raycast"
cask "homerow"
cask "orbstack"
cask "google-chrome"
cask "spotify"
cask "claude"
cask "font-monaspace"

# Microsoft
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-word"
cask "onedrive"
